# Cardiovascular Disease Dataset

In [8]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

### Connect to SQL Database in Jupyter Notebook

In [1]:
from sqlalchemy import create_engine

#Connect to local database
engine = create_engine("sqlite:///C:\\Users\sandr\OneDrive\Desktop\Metis\DS_Engineering\Projects\Data_Pipeline\github_files\cardiovascular_mortality_db.db")

In [2]:
#Check tables in database
engine.table_names()

C:\Users\sandr\AppData\Local\Temp/ipykernel_271564/2034969820.py:2: SADeprecationWarning: The Engine.table_names() method is deprecated and will be removed in a future release.  Please refer to Inspector.get_table_names(). (deprecated since: 1.4)
  engine.table_names()

['cv_mortality', 'new_table']

In [3]:
#Use ipython-sql enables running SQL queries directly from Jupyter
#Load ipython-sql extension
%load_ext sql

In [4]:
#Print the engine connection string
print("connecting with engine " + str(engine))

connecting with engine Engine(sqlite:///C:\Users\sandr\OneDrive\Desktop\Metis\DS_Engineering\Projects\Data_Pipeline\github_files\cardiovascular_mortality_db.db)

In [5]:
#Use connection string to connect
%sql sqlite:///C:\Users\sandr\OneDrive\Desktop\Metis\DS_Engineering\Projects\Data_Pipeline\github_files\cardiovascular_mortality_db.db

In [6]:
%%sql
SELECT * FROM new_table LIMIT 3;

 * sqlite:///C:\Users\sandr\OneDrive\Desktop\Metis\DS_Engineering\Projects\Data_Pipeline\github_files\cardiovascular_mortality_db.db
Done.

[(1001, 2000, 'AL', 'Autauga', 'Cardiovascular Diseases', '76.9', 'per 100,000', '61.5', '99.6', 'Ages 35-64 years', 'Black', 'Overall', -86.64295911, 32.53530561),
 (1001, 2001, 'AL', 'Autauga', 'Cardiovascular Diseases', '83.4', 'per 100,000', '69', '126.7', 'Ages 35-64 years', 'Black', 'Overall', -86.64295911, 32.53530561),
 (1001, 2002, 'AL', 'Autauga', 'Cardiovascular Diseases', '86.2', 'per 100,000', '66.7', '122.1', 'Ages 35-64 years', 'Black', 'Overall', -86.64295911, 32.53530561)]

In [9]:
#Read in database as dataframe
df = pd.read_sql('SELECT * FROM new_table;', engine)
df.head()

,LocationID,Year,State,County,Class,Data_Value,Data_Value_Unit,Confidence_limit_Low,Confidence_limit_High,Age Group,Race/Ethnicity,Sex,X_long,Y_lat
0,1001,2000,AL,Autauga,Cardiovascular Diseases,76.9,"per 100,000",61.5,99.6,Ages 35-64 years,Black,Overall,-86.642959,32.535306
1,1001,2001,AL,Autauga,Cardiovascular Diseases,83.4,"per 100,000",69,126.7,Ages 35-64 years,Black,Overall,-86.642959,32.535306
2,1001,2002,AL,Autauga,Cardiovascular Diseases,86.2,"per 100,000",66.7,122.1,Ages 35-64 years,Black,Overall,-86.642959,32.535306
3,1001,2003,AL,Autauga,Cardiovascular Diseases,81.6,"per 100,000",58.5,117,Ages 35-64 years,Black,Overall,-86.642959,32.535306
4,1001,2004,AL,Autauga,Cardiovascular Diseases,84.7,"per 100,000",63.7,114.6,Ages 35-64 years,Black,Overall,-86.642959,32.535306

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 520520 entries, 0 to 520519
Data columns (total 14 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   LocationID             520520 non-null  int64
 1   Year                   520520 non-null  int64
 2   State                  520520 non-null  object
 3   County                 520520 non-null  object
 4   Class                  520520 non-null  object
 5   Data_Value             520520 non-null  object
 6   Data_Value_Unit        520520 non-null  object
 7   Confidence_limit_Low   520520 non-null  object
 8   Confidence_limit_High  520520 non-null  object
 9   Age Group              520520 non-null  object
 10  Race/Ethnicity         520520 non-null  object
 11  Sex                    520520 non-null  object
 12  X_long                 520520 non-null  float64
 13  Y_lat                  520520 non-null  float64
dtypes: float64(2), int64(2), object(10)
memory usage: 55.6+ MB

### Clean up data

In [12]:
#Convert appropriate datatypes to numeric
df[['Year', 'Data_Value', 'Confidence_limit_Low', 'Confidence_limit_High']]=df[['Year','Data_Value', 'Confidence_limit_Low', 'Confidence_limit_High']].apply(pd.to_numeric)

In [13]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 520520 entries, 0 to 520519
Data columns (total 14 columns):
 #   Column                 Non-Null Count   Dtype
---  ------                 --------------   -----
 0   LocationID             520520 non-null  int64
 1   Year                   520520 non-null  int64
 2   State                  520520 non-null  object
 3   County                 520520 non-null  object
 4   Class                  520520 non-null  object
 5   Data_Value             520520 non-null  float64
 6   Data_Value_Unit        520520 non-null  object
 7   Confidence_limit_Low   520520 non-null  float64
 8   Confidence_limit_High  520520 non-null  float64
 9   Age Group              520520 non-null  object
 10  Race/Ethnicity         520520 non-null  object
 11  Sex                    520520 non-null  object
 12  X_long                 520520 non-null  float64
 13  Y_lat                  520520 non-null  float64
dtypes: float64(5), int64(2), object(7)
memory usage: 55.6+ MB

In [31]:
#Rename columns
df.rename(columns={"LocationID":"Location_ID", "Age Group":"Age_Group", "Race/Ethnicity":"Race_Ethinicity"}, inplace=True)

In [32]:
df.columns

Index(['Location_ID', 'Year', 'State', 'County', 'Class', 'Data_Value',
       'Data_Value_Unit', 'Confidence_limit_Low', 'Confidence_limit_High',
       'Age_Group', 'Race_Ethinicity', 'Sex', 'X_long', 'Y_lat'],
      dtype='object')

### Save to Pickle File

In [33]:
df.to_pickle("cv_mortality")

### Read in Pickle File

In [34]:
df = pd.read_pickle("cv_mortality")

### Import Pandasql to Use SQL on Dataframes

In [19]:
from pandasql import sqldf
pysqldf = lambda q: sqldf(q, globals())

In [37]:
q = """ SELECT Year, State, Age_Group, Sex, AVG(Data_Value)
        FROM df
        GROUP BY Sex, Year, Age_Group;"""
by_gender = pysqldf(q)
by_gender

     Year State         Age_Group      Sex  AVG(Data_Value)
0    2000    AL  Ages 35-64 years   Female        19.590970
1    2000    AL    Ages 65+ years   Female       384.710762
2    2001    AL  Ages 35-64 years   Female        19.612093
3    2001    AL    Ages 65+ years   Female       392.555856
4    2002    AL  Ages 35-64 years   Female        20.192069
..    ...   ...               ...      ...              ...
115  2017    AL    Ages 65+ years  Overall       446.357879
116  2018    AL  Ages 35-64 years  Overall        51.751295
117  2018    AL    Ages 65+ years  Overall       451.826860
118  2019    AL  Ages 35-64 years  Overall        53.522513
119  2019    AL    Ages 65+ years  Overall       469.408120

[120 rows x 5 columns]